
//Суть проекта - пошаговая симуляция 2D мира, населённого травоядными и хищниками.
//Кроме существ, мир содержит ресурсы (траву), которым питаются травоядные,
// и статичные объекты, с которыми нельзя взаимодействовать - они просто занимают место.
/*
Главный класс приложения, включает в себя:
Карту
Счётчик ходов
Рендерер поля
Actions - список действий, исполняемых перед стартом симуляции или на каждом ходу (детали ниже)
 */

import java.util.*;

public class Simulation {

    WordMap wordMap;
    Actions actions;

    public void nextTurn() {

    }

    public void startSimulation() {

    }

    public static void pauseSimulation() {

    }

}
